
### :robot: Terraform Report
---
##### Plan: `3` to add, `1` to change, `3` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # github_actions_repository_permissions.this["image-operator"] will be updated in-place
  ~ resource "github_actions_repository_permissions" "this" {
        id              = "skopeo-operator"
      ~ repository      = "skopeo-operator" -> "image-operator"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_branch_protection.this["image-operator"] will be created
  + resource "github_branch_protection" "this" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "master"
      + repository_id                   = "image-operator"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_status_checks {
          + strict = false
        }
    }

  # github_branch_protection.this["skopeo-operator"] will be destroyed
  # (because key ["skopeo-operator"] is not in for_each map)
  - resource "github_branch_protection" "this" {
      - allows_deletions                = false -> null
      - allows_force_pushes             = false -> null
      - enforce_admins                  = true -> null
      - force_push_bypassers            = [] -> null
      - id                              = "BPR_kwDONCkm_s4DUUyo" -> null
      - lock_branch                     = false -> null
      - pattern                         = "master" -> null
      - repository_id                   = "skopeo-operator" -> null
      - require_conversation_resolution = false -> null
      - require_signed_commits          = false -> null
      - required_linear_history         = false -> null

      - required_status_checks {
          - contexts = [] -> null
          - strict   = false -> null
        }
    }

  # github_repository.repositories["image-operator"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Skopeo operator to copy Docker images from your Kubernetes cluster."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_discussions             = false
      + has_downloads               = false
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "image-operator"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "docker",
          + "image",
          + "skopeo",
        ]
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + pages {
          + build_type = "legacy"
          + custom_404 = (known after apply)
          + html_url   = (known after apply)
          + status     = (known after apply)
          + url        = (known after apply)

          + source {
              + branch = "gh-pages"
              + path   = "/"
            }
        }

      + security_and_analysis (known after apply)
    }

  # github_repository.repositories["skopeo-operator"] will be destroyed
  # (because key ["skopeo-operator"] is not in for_each map)
  - resource "github_repository" "repositories" {
      - allow_auto_merge            = true -> null
      - allow_merge_commit          = false -> null
      - allow_rebase_merge          = false -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archive_on_destroy          = true -> null
      - archived                    = false -> null
      - auto_init                   = true -> null
      - default_branch              = "master" -> null
      - delete_branch_on_merge      = true -> null
      - description                 = "Skopeo operator to copy Docker images from your Kubernetes cluster." -> null
      - etag                        = "W/\"78b1d539de4781a9c06e5ba35619a9867be09b3ca00f0e96374cd45305fbb307\"" -> null
      - full_name                   = "Tchoupinax/skopeo-operator" -> null
      - git_clone_url               = "git://github.com/Tchoupinax/skopeo-operator.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/Tchoupinax/skopeo-operator" -> null
      - http_clone_url              = "https://github.com/Tchoupinax/skopeo-operator.git" -> null
      - id                          = "skopeo-operator" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "skopeo-operator" -> null
      - node_id                     = "R_kgDONCkm_g" -> null
      - primary_language            = "Go" -> null
      - private                     = false -> null
      - repo_id                     = 875112190 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:Tchoupinax/skopeo-operator.git" -> null
      - svn_url                     = "https://github.com/Tchoupinax/skopeo-operator" -> null
      - topics                      = [
          - "docker",
          - "image",
          - "skopeo",
        ] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null
      - web_commit_signoff_required = false -> null
        # (1 unchanged attribute hidden)

      - pages {
          - build_type = "legacy" -> null
          - custom_404 = false -> null
          - html_url   = "https://tchoupinax.github.io/skopeo-operator/" -> null
          - status     = "built" -> null
          - url        = "https://api.github.com/repos/Tchoupinax/skopeo-operator/pages" -> null
            # (1 unchanged attribute hidden)

          - source {
              - branch = "gh-pages" -> null
              - path   = "/" -> null
            }
        }

      - security_and_analysis {
          - secret_scanning {
              - status = "disabled" -> null
            }
          - secret_scanning_push_protection {
              - status = "disabled" -> null
            }
        }
    }

  # github_repository_file.renovate_json["image-operator"] will be created
  + resource "github_repository_file" "renovate_json" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "master"
      + commit_author                = "Terraform Bot"
      + commit_email                 = "terraform@corentinfiloche.xyz"
      + commit_message               = "chore: create or upgrade renovate configuration"
      + commit_sha                   = (known after apply)
      + content                      = jsonencode(
            {
              + "$schema"           = "https://docs.renovatebot.com/renovate-schema.json"
              + extends             = [
                  + "config:recommended",
                  + "group:allNonMajor",
                ]
              + labels              = [
                  + "renovate",
                ]
              + lockFileMaintenance = {
                  + automerge = true
                  + enabled   = true
                }
              + packageRules        = [
                  + {
                      + automerge           = true
                      + matchCurrentVersion = "!/^0/"
                      + matchUpdateTypes    = [
                          + "minor",
                          + "patch",
                        ]
                    },
                ]
            }
        )
      + file                         = "renovate.json"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "image-operator"
      + sha                          = (known after apply)
    }

  # github_repository_file.renovate_json["skopeo-operator"] will be destroyed
  # (because key ["skopeo-operator"] is not in for_each map)
  - resource "github_repository_file" "renovate_json" {
      - branch              = "master" -> null
      - commit_author       = "Terraform Bot" -> null
      - commit_email        = "terraform@corentinfiloche.xyz" -> null
      - commit_message      = "chore: create or upgrade renovate configuration" -> null
      - commit_sha          = "1db5162e8ab37d9897f237f433799306d659f1ec" -> null
      - content             = jsonencode(
            {
              - "$schema"           = "https://docs.renovatebot.com/renovate-schema.json"
              - extends             = [
                  - "config:recommended",
                  - "group:allNonMajor",
                ]
              - labels              = [
                  - "renovate",
                ]
              - lockFileMaintenance = {
                  - automerge = true
                  - enabled   = true
                }
              - packageRules        = [
                  - {
                      - automerge           = true
                      - matchCurrentVersion = "!/^0/"
                      - matchUpdateTypes    = [
                          - "minor",
                          - "patch",
                        ]
                    },
                ]
            }
        ) -> null
      - file                = "renovate.json" -> null
      - id                  = "skopeo-operator/renovate.json" -> null
      - overwrite_on_create = true -> null
      - ref                 = "master" -> null
      - repository          = "skopeo-operator" -> null
      - sha                 = "3a190a106c4f0bc1eb6048962e377458707582dc" -> null
    }

Plan: 3 to add, 1 to change, 3 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#11627654471`](https://github.com/Tchoupinax/repo-config/actions/runs/11627654471) - commit 303fa8c4357c962bda9c237fc5026225e0c61dd7
